In [2]:
# Import libraries
import mysql.connector 
import pandas as pd

In [3]:
# Create connection
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'xxxxxx',
    database = 'retrowheels'
)

In [5]:
# Soal 1
mycursor = mydb.cursor()

query = 'SELECT COUNT(DISTINCT(customerName)) AS Customers,COUNT(DISTINCT(city)) AS Cities,COUNT(DISTINCT(country)) AS Countries FROM customers'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

   Customers  Cities  Countries
0        122      95         27

In [6]:
# Soal 2
mycursor = mydb.cursor()

query = 'SELECT (SELECT COUNT(DISTINCT employeeNumber) FROM employees) AS Employees, (SELECT COUNT(DISTINCT officeCode) FROM offices) AS Offices, (SELECT COUNT(DISTINCT country) FROM offices) AS Country, (SELECT COUNT(DISTINCT productCode) FROM products) AS Products, (SELECT SUM(quantityInStock) FROM products) AS StockProducts, (SELECT COUNT(DISTINCT productVendor) FROM products) AS Vendors'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

   Employees  Offices  Country  Products StockProducts  Vendors
0         23        7        5       110        555131       13

In [7]:
# Soal 3
mycursor = mydb.cursor()

query = 'SELECT DISTINCT productline, min(buyPrice) AS minPrice, max(buyPrice) AS maxPrice FROM products group by productline'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

    productline minPrice maxPrice
0  Classic Cars    15.91   103.42
1   Motorcycles    24.14    91.02
2        Planes    29.34    77.27
3         Ships    33.30    82.34
4        Trains    26.72    67.56

In [8]:
# Soal 4
mycursor = mydb.cursor()

query = 'SELECT customername, city, country, SUM(amount) AS total FROM customers, payments WHERE customers.customernumber= payments.customernumber group by customers.customernumber order by total desc LIMIT 10'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

                   customername        city    country      total
0        Euro+ Shopping Channel      Madrid      Spain  715738.98
1  Mini Gifts Distributors Ltd.  San Rafael        USA  584188.24
2    Australian Collectors, Co.   Melbourne  Australia  180585.07
3            Muscle Machine Inc         NYC        USA  177913.95
4       Dragon Souveniers, Ltd.   Singapore  Singapore  156251.03

In [9]:
# Soal 5
mycursor = mydb.cursor()

query = ' select c.customerName, p.productName, od.quantityOrdered, od.priceEach from products as p inner join orderdetails as od using (productCode) inner join orders as o using (orderNumber) inner join customers as c using (customerNumber) inner join payments as py using (customerNumber) where py.paymentDate = "2003-06-05" and o.orderNumber=10123'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

,customerName,productName,quantityOrdered,priceEach
0,Atelier graphique,1965 Aston Martin DB5,26,120.71
1,Atelier graphique,1999 Indy 500 Monte Carlo SS,46,114.84
2,Atelier graphique,1948 Porsche Type 356 Roadster,34,117.26
3,Atelier graphique,1966 Shelby Cobra 427 S/C,50,43.27